app/controllers/articles_controller.rb

INSERT INTO "articles" ("name", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Superman"], ["content", "djknfjknddhdbhfbh"], ["created_at", "2018-03-07 08:57:29.756312"], ["updated_at", "2018-03-07 08:57:29.756312"]]
---
  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def upvote
    @article = Article.find(params[:id])

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def downvote
    @article = Article.find(params[:id])