app/controllers/students_controller.rb

INSERT INTO "students" ("name", "rollno", "email", "phoneno", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "jinal"], ["rollno", "1"], ["email", "jinal@gmail.com"], ["phoneno", "89098796"], ["created_at", "2018-01-30 06:55:14.236712"], ["updated_at", "2018-01-30 06:55:14.236712"]]
---
  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save